{"pageProps":{"allPosts":[{"title":"A sad parallel in work relationships and personal relationships","date":"2022-11-13","slug":"2022-11-13-parallels","html":"<h2 id=\"in-my-job-i-often-butt-heads-with-my-boss\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#in-my-job-i-often-butt-heads-with-my-boss\"><a href=\"#in-my-job-i-often-butt-heads-with-my-boss\" style=\"margin-right: 10px\">#</a></a>In my job, I often butt heads with my boss.</h2>\n<p>I feel like my boss rarely has a clue for what is right for our project. I feel\nhe is very aloof. And I feel like his engagement with important situations is\noften fairly shallow. I feel very stressed out and frayed very constantly,\nwhile I think my boss feels very little of this, and he often gives overly\noptimistic outlooks.</p>\n<h2 id=\"with-my-partner-at-home-there-is-a-disturbing-parallel\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#with-my-partner-at-home-there-is-a-disturbing-parallel\"><a href=\"#with-my-partner-at-home-there-is-a-disturbing-parallel\" style=\"margin-right: 10px\">#</a></a>With my partner at home, there is a disturbing parallel</h2>\n<p>I often have not very much engagement on domestic issues such as for example,\ntravel, lodging, etc. I just think everything is fine, and whatever ends up\nhappening is ok. And yet, my girlfriend is often running very high stress about\nthese issues. She claims that I don't listen to her, and is often extremely\nannoyed by the input that I do have.</p>\n<h2 id=\"whats-the-conclusion-or-resolution-to-these-issues\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#whats-the-conclusion-or-resolution-to-these-issues\"><a href=\"#whats-the-conclusion-or-resolution-to-these-issues\" style=\"margin-right: 10px\">#</a></a>What's the conclusion or resolution to these issues?</h2>\n<p>I do not know. In my job, I need to chill the fuck out or find a better\nsolution than butting heads all the time. Same thing in my personal life, yet\nin that case, I feel like I am not the fight-seeker.</p>"},{"title":"Waiting for feedback","date":"2020-12-07","slug":"2021-12-07-waiting","html":"<p>Sometimes, basically removing the enhancement, or disabling it, will fix it</p>\n<p>So, I oftentimes will make a PR to this effect and say, \"here is a fix, it\nbasically removes the enhancement, and fixes a bug. This is a bug users\ndefinitely will definitely run into, so we should probably merge this and\nrelease it so that they don't run into it\". what I normally get in response to\nthis is crickets</p>\n<p>I can guess at some reasons why my coworkers are avoiding this issue maybe. For\nexample</p>\n<ul>\n<li>\n<p>they don't want to \"duplicate work\" by undoing the enhancement on the master\nbranch (and later redoing it)</p>\n</li>\n<li>\n<p>they have pride in their feature and don't want to see it undone</p>\n</li>\n<li>\n<p>they are trying to be sensitive to the feelings of the person who originally\ndeveloped the enhancement, and avoid undoing it</p>\n</li>\n<li>\n<p>they are not \"satisfied\" with the PR that removes the enhancement, and would\nrather see a fix to the enhancement</p>\n</li>\n</ul>\n<p>The reality though is there is often very little feedback on these PRs that I\nmake, so I just have to sit around with anxiety. There are currently at least 3\nof these on my codebase from enhancements I did not make, but which I created\nfixes for that basically rollback portions of these enhancements. Oftentimes\ntook me pretty deep debugging to even figure out that one weird enhancement had\nsuch a weird knock on effect to create bug X and so with the silence from my\nteam, i feel unappreciated in addition to all this.</p>\n<p>This is, perhaps, not really unique to my particular scenario. The feelings\nthat I get from this, anxiety and feeling unappreciated, can happen in many\nother scenarios, exacerbated by remote work, pandemic, team culture, etc. I\nhope to work to make things better somehow though</p>"}]},"__N_SSG":true}