{"pageProps":{"post":{"title":"A sad parallel in work relationships and personal relationships","date":"2022-11-13","slug":"2022-11-13-parallels","html":"<h2 id=\"in-my-job-i-often-butt-heads-with-my-boss\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#in-my-job-i-often-butt-heads-with-my-boss\"><a href=\"#in-my-job-i-often-butt-heads-with-my-boss\" style=\"margin-right: 10px\">#</a></a>In my job, I often butt heads with my boss.</h2>\n<p>I feel like my boss rarely has a clue for what is right for our project. I feel\nhe is very aloof. And I feel like his engagement with important situations is\noften fairly shallow. I feel very stressed out and frayed very constantly,\nwhile I think my boss feels very little of this, and he often gives overly\noptimistic outlooks.</p>\n<h2 id=\"with-my-partner-at-home-there-is-a-disturbing-parallel\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#with-my-partner-at-home-there-is-a-disturbing-parallel\"><a href=\"#with-my-partner-at-home-there-is-a-disturbing-parallel\" style=\"margin-right: 10px\">#</a></a>With my partner at home, there is a disturbing parallel</h2>\n<p>I often have not very much engagement on domestic issues such as for example,\ntravel, lodging, etc. I just think everything is fine, and whatever ends up\nhappening is ok. And yet, my girlfriend is often running very high stress about\nthese issues. She claims that I don't listen to her, and is often extremely\nannoyed by the input that I do have.</p>\n<h2 id=\"whats-the-conclusion-or-resolution-to-these-issues\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#whats-the-conclusion-or-resolution-to-these-issues\"><a href=\"#whats-the-conclusion-or-resolution-to-these-issues\" style=\"margin-right: 10px\">#</a></a>What's the conclusion or resolution to these issues?</h2>\n<p>I do not know. In my job, I need to chill the fuck out or find a better\nsolution than butting heads all the time. Same thing in my personal life, yet\nin that case, I feel like I am not the fight-seeker.</p>"}},"__N_SSG":true}